#### Dave Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_s3_bucket.data: Refreshing state... [id=gitops-demo-s3-bucket-data-v2]
aws_s3_bucket.data_log_bucket: Refreshing state... [id=gitops-is-awseome-v2]
aws_s3_bucket_versioning.data: Refreshing state... [id=gitops-demo-s3-bucket-data-v2]
aws_s3_bucket_logging.data: Refreshing state... [id=gitops-demo-s3-bucket-data-v2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.data must be replaced
-/+ resource "aws_s3_bucket" "data" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gitops-demo-s3-bucket-data-v2" -> (known after apply)
      ~ bucket                      = "gitops-demo-s3-bucket-data-v2" -> "gitops-demo-s3-bucket-data-v2-review" # forces replacement
      ~ bucket_domain_name          = "gitops-demo-s3-bucket-data-v2.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "gitops-demo-s3-bucket-data-v2.s3.ap-southeast-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z1WCIGYICN2BYD" -> (known after apply)
      ~ id                          = "gitops-demo-s3-bucket-data-v2" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "d59ae24b85f49360bf0f4669ee56027bba50bb67324d990b8cd3d441bf243d50" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      ~ logging {
          ~ target_bucket = "gitops-is-awseome-v2" -> (known after apply)
          ~ target_prefix = "log/" -> (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # aws_s3_bucket_logging.data must be replaced
-/+ resource "aws_s3_bucket_logging" "data" {
      ~ bucket        = "gitops-demo-s3-bucket-data-v2" -> (known after apply) # forces replacement
      ~ id            = "gitops-demo-s3-bucket-data-v2" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_s3_bucket_versioning.data must be replaced
-/+ resource "aws_s3_bucket_versioning" "data" {
      ~ bucket = "gitops-demo-s3-bucket-data-v2" -> (known after apply) # forces replacement
      ~ id     = "gitops-demo-s3-bucket-data-v2" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.data,
  on gitops-iac.tf line 7, in resource "aws_s3_bucket" "data":
   7:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @davesc63, Action: `pull_request`*